---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SweptBlend
source: html/8f013db3-3db1-4880-cf33-46a003e12349.htm
---
# SweptBlend Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.